CSI API ETABS v1

# eUnits Enumeration

---

The units that can be specified for the model.

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    public enum eUnits

    Public Enumeration eUnits

    Dim instance As eUnits

    public enum class eUnits

    type eUnits

Members

| Member name| Value| Description
---|---|---|---
| lb_in_F| 1|
| lb_ft_F| 2|
| kip_in_F| 3|
| kip_ft_F| 4|
| kN_mm_C| 5|
| kN_m_C| 6|
| kgf_mm_C| 7|
| kgf_m_C| 8|
| N_mm_C| 9|
| N_m_C| 10|
| Ton_mm_C| 11|
| Ton_m_C| 12|
| kN_cm_C| 13|
| kgf_cm_C| 14|
| N_cm_C| 15|
| Ton_cm_C| 16|

Remarks

See Also

#### Reference

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com